ReadingsArrays.StPaulArrayFR= [
    [
        [
            "RSP_&D=0101&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس ( 5 : 11 - 6 :1 - 13 )",
            "2CO: 5:11 - 6:13",
            "2CO: 5:11-6:13"
        ],
        [
            Prefix.readingRef + "2CO:5:11-End"
        ],
        [
            Prefix.readingRef + "2CO:6:1-13"
        ]
    ],
    [
        [
            "RSP_&D=JFast1&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة (6: 17-23)",
            "ROM:(6: 17-23)",
            "ROM:(6: 17-23)"
        ],
        [
            Prefix.readingRef + "ROM:6:17-23"
        ]
    ],
    [
        [
            "RSP_&D=JFast2&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ كُولُوسِي (1: 21-29)",
            "COL:(1: 21-29)",
            "COL:(1: 21-29)"
        ],
        [
            Prefix.readingRef + "COL:1:21-29"
        ]
    ],
    [
        [
            "RSP_&D=JFast3||2409&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ (2: 1-22)",
            "EPH:(2: 1-22)",
            "EPH:Ephésiens (2: 1-22)"
        ],
        [
            Prefix.readingRef + "EPH:2:1-22"
        ]
    ],
    [
        [
            "RSP_&D=011stSunday&C=Title",
            "من رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى تيموثاوس 1 : 12 - 19",
            "1TI: 1:12-19",
            ""
        ],
        [
            Prefix.readingRef + "1TI:1:12-19"
        ]
    ],
    [
        [
            "RSP_&D=012ndSunday&C=Title",
            "رسالة بولس الرسول الثانية إلى تيموثاوس (1: 12 & 2:10)",
            "2TI: (1: 12 & 2:10)",
            ""
        ],
        [
            Prefix.readingRef + "2TI:1:12-End"
        ],
        [
            Prefix.readingRef + "2TI:2:1-10"
        ]
    ],
    [
        [
            "RSP_&D=013rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 2: 1 - 16 )",
            "1CO: (2: 1-16)",
            "1CO:(2: 1-16)"
        ],
        [
            Prefix.readingRef + "1CO:2:1-16"
        ]
    ],
    [
        [
            "RSP_&D=014thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس 1 : 1 - 14",
            "2CO: (1: 1-14)",
            "2CO: (1: 1-14)"
        ],
        [
            Prefix.readingRef + "2CO:1:1-14"
        ]
    ],
    [
        [
            "RSP_&D=015thSunday||062ndSunday&C=Title",
            " عبرانيين 7: 1-17",
            "HEB:7:1-17",
            "HEB:7:1-17"
        ],
        [
            Prefix.readingRef + "HEB:7:1-17"
        ]
    ],
    [
        [
            "RSP_&D=0801||2304&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين ( 11 : 17 - 27 )",
            "HEB:11 : 17 - 27",
            "HEB:11:17-27"
        ],
        [
            Prefix.readingRef + "HEB:11:17-27"
        ]
    ],
    [
        [
            "RSP_&D=1601&C=Title",
            " عبرانيين 9: 1-10",
            "HEB:9:1-10",
            "HEB:9:1-10"
        ],
        [
            Prefix.readingRef + "HEB:9:1-10"
        ]
    ],
    [
        [
            "RSP_&D=1701&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس: (1: 17-31)",
            "1CO:: (1: 17-31)",
            "1 Corinthians: (1: 17-31)"
        ],
        [
            Prefix.readingRef + "1CO:1:17-31"
        ]
    ],
    [
        [
            "RSP_&D=1801&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ غلاطية ((6:11-18",
            "GAL: 6:11-18",
            "GAL: 6:11-18"
        ],
        [
            Prefix.readingRef + "Galatians6:11-18"
        ]
    ],
    [
        [
            "RSP_&D=1901&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ كُولُوسِي (2: 6-19)",
            "COL:2: 6-19",
            "COL:2: 6-19"
        ],
        [
            Prefix.readingRef + "COL:2:6-19"
        ]
    ],
    [
        [
            "RSP_&D=2101&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ فيلبي (1: 1-11)",
            "PHP:1: 1-11",
            "PHP:1: 1-11"
        ],
        [
            Prefix.readingRef + "PHP:1:1-11"
        ]
    ],
    [
        [
            "RSP_&D=2601&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ رُومِيَّة (1:1-17)",
            "ROM:(1: 1-17)",
            "ROM:(1: 1-17)"
        ],
        [
            Prefix.readingRef + "ROM:1:1-17"
        ]
    ],
    [
        [
            "RSP_&D=021stSunday&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس ) 2:12-3:6)",
            "2CO: 2:12-3:6",
            "2CO: 2:12-3:6"
        ],
        [
            Prefix.readingRef + "2CO:2:12-End"
        ],
        [
            Prefix.readingRef + "2CO:3:1-6"
        ]
    ],
    [
        [
            "RSP_&D=023rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس16:12-24",
            "1CO: 16:12-24",
            "1CO:16:12-24"
        ],
        [
            Prefix.readingRef + "1CO:16:12-24"
        ]
    ],
    [
        [
            "RSP_&D=1202&C=Title",
            " بولس الرسول الثانية إلى أَهْلِ أَفَسُسْ (4:11-19)",
            "EPH:4:11-19",
            "EPH:4:11-19"
        ],
        [
            Prefix.readingRef + "EPH:4:11-19"
        ]
    ],
    [
        [
            "RSP_&D=1402&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ تيطس ( 2 : 11 – 3 : 7 )",
            "TIT: 2:11-3:7",
            "TIT: 2:11-3:7"
        ],
        [
            Prefix.readingRef + "TIT:2:11-End"
        ],
        [
            Prefix.readingRef + "TIT:3:1-7"
        ]
    ],
    [
        [
            "RSP_&D=2202&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كُولُوسِي 4:2-18",
            "COL:4:2-18",
            "COL:4:2-18"
        ],
        [
            Prefix.readingRef + "COL:4:2-18"
        ]
    ],
    [
        [
            "RSP_&D=2702&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ العبرانيين(11:17-31)",
            "HEB:11:17-31",
            "HEB:11:17-31"
        ],
        [
            Prefix.readingRef + "HEB:11:17-31"
        ]
    ],
    [
        [
            "RSP_&D=031stSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس( 9 : 1 - 9)",
            "2CO: 9:1-9",
            "2CO: 9:1-9"
        ],
        [
            Prefix.readingRef + "2CO:9:1-9"
        ]
    ],
    [
        [
            "RSP_&D=032ndSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين( 6 : 7 - 15 )",
            "HEB:6:7-15",
            "HEB:6:7-15"
        ],
        [
            Prefix.readingRef + "HEB:6:7-15"
        ]
    ],
    [
        [
            "RSP_&D=033rdSunday&C=Title",
            "رسالة بولس الرَّسول الثانية إلى أَهْلِ تسالونيك (1: 1-12)",
            "2TH:(1: 1-12)",
            "2 Thessalonians (1: 1-12)"
        ],
        [
            Prefix.readingRef + "2TH:1:1-12"
        ]
    ],
    [
        [
            "RSP_&D=034thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 4 : 1 - 16 )",
            "1CO:4:1-16",
            "1CO:4:1-16"
        ],
        [
            Prefix.readingRef + "1CO:4:1-16"
        ]
    ],
    [
        [
            "RSP_&D=0803&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ العبرانيين (12:21 - 13:1-2)",
            "HEB:12:21 - 13:1-2",
            "HEB:12:21-39 &13:1-2"
        ],
        [
            Prefix.readingRef + "HEB:12:21-End"
        ],
        [
            Prefix.readingRef + "HEB:13:1-2"
        ]
    ],
    [
        [
            "RSP_&D=0903&C=Title",
            " بولس الرسول إلى أَهْلِ رُومِيَّة (4:13-25&5:1-5)",
            "ROM:(4: 13 & 5: 1-5)",
            "ROM:(4: 13-25 & 5: 1-5)"
        ],
        [
            Prefix.readingRef + "ROM:4:13-End"
        ],
        [
            Prefix.readingRef + "ROM:5:1-5"
        ]
    ],
    [
        [
            "RSP_&D=1203||2904&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ العبرانيين (1 : 1 – 2 : 4 )",
            "HEB:1:1 - 2:4",
            "HEB:(1: 1-14)&2:1-4"
        ],
        [
            Prefix.readingRef + "HEB:1:1-End"
        ],
        [
            Prefix.readingRef + "HEB:2:1-4"
        ]
    ],
    [
        [
            "RSP_&D=1503||2605&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ العبرانيين (12:3-14)",
            "HEB:(12: 3-14)",
            "HEB:(12: 3-14)"
        ],
        [
            Prefix.readingRef + "HEB:12:3-14"
        ]
    ],
    [
        [
            "RSP_&D=1703&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى تيطس (3:10 - 4:1-22 )",
            "2TIT: 3:10 - 4:1-22",
            "2Timothy 3:10-17& 4:1-22"
        ],
        [
            Prefix.readingRef + "2TIT:3:10-End"
        ],
        [
            Prefix.readingRef + "2TIT:4:1-22"
        ]
    ],
    [
        [
            "RSP_&D=2203||2612&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى رُومِيَّة (8:14-27)",
            "ROM:(8: 14-27)",
            "ROM:(8: 14-27)"
        ],
        [
            Prefix.readingRef + "ROM:8:14-27"
        ]
    ],
    [
        [
            "RSP_&D=2403&C=Title",
            " بولس الرسول الثانية إلى أَهْلِ تيموثاوس ( 5 : 17 -6 : 2 )",
            "1TI:5:17 - 6:1-2",
            "1TI:5:17-25 & 6:1-2"
        ],
        [
            Prefix.readingRef + "1TI:5:17-End"
        ],
        [
            Prefix.readingRef + "1TI:6:1-2"
        ]
    ],
    [
        [
            "RSP_&D=2803&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين (7:18 - 8:1-13 )",
            "HEB:7:18 - 8:1-13",
            "Hebrews7:18-28 & 8:1-13"
        ],
        [
            Prefix.readingRef + "HEB:7:18-End"
        ],
        [
            Prefix.readingRef + "HEB:8:1-13"
        ]
    ],
    [
        [
            "RSP_&D=2903&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ العبرانيين (4:14 - 5:1-14 )",
            "HEB:4:14 - 5:1-14",
            "HEB:4:14-5:14"
        ],
        [
            Prefix.readingRef + "HEB:4:14-End"
        ],
        [
            Prefix.readingRef + "HEB:5:1-14"
        ]
    ],
    [
        [
            "RSP_&D=041stSunday&C=Title",
            " البولس من رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 1 : 1 - 17 )",
            "ROM:1:1-17",
            "ROM:1:1-17"
        ],
        [
            Prefix.readingRef + "ROM:1:1-17"
        ]
    ],
    [
        [
            "RSP_&D=042ndSunday&C=Title",
            " البولس من رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 3 : 1- 4 : 1- 3 )",
            "ROM:(3: 1-30 & 4:1-3)",
            "ROM:(3: 1-30 & 4:1-3)"
        ],
        [
            Prefix.readingRef + "ROM:3:1-End"
        ],
        [
            Prefix.readingRef + "ROM:4:1-3"
        ]
    ],
    [
        [
            "RSP_&D=2907&C=Title",
            " البولس من رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 3 : 1- 4 : 1- 3 )",
            "ROM:(3: 1-30)",
            "ROM:(3: 1-30)"
        ],
        [
            Prefix.readingRef + "ROM:3:1-30"
        ]
    ],
    [
        [
            "RSP_&D=043rdSunday&C=Title",
            " البولس من رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 4 : 4 - 24 )",
            "ROM:(4: 4-24)",
            "ROM:(4: 4-24)"
        ],
        [
            Prefix.readingRef + "ROM:4:4-24"
        ]
    ],
    [
        [
            "RSP_&D=044thSunday&C=Title",
            " البولس من رِسَالَةِ بُولِسِ الرَسُولِ إلىأهل رومية( 9 : 6 - 33 )",
            "ROM:(9: 6-33)",
            "ROM:(9: 6-33)"
        ],
        [
            Prefix.readingRef + "ROM:9:6-33"
        ]
    ],
    [
        [
            "RSP_&D=2204||0313&C=Title",
            " بولس الرسول الأولى إلى أَهْلِ عبرانين 2:5-18",
            "HEB:2:5-18",
            "HEB:2:5-18"
        ],
        [
            Prefix.readingRef + "HEB:2:5-18"
        ]
    ],
    [
        [
            "RSP_&D=2804&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ غلاطية ( ( 3:15-29 &4:1-18",
            "GAL:3:15 - 4:1-18",
            "GAL: 3:15-29 &4:1-18"
        ],
        [
            Prefix.readingRef + "GAL:3:15-End"
        ],
        [
            Prefix.readingRef + "GAL:4:1-18"
        ]
    ],
    [
        [
            "RSP_&D=3004&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ غلاطية (4:19-31 & 5:1)",
            "GAL: 4:19-31 & 5:1",
            "GAL: 4:19-31 & 5:1"
        ],
        [
            Prefix.readingRef + "GAL:4:19-End"
        ],
        [
            Prefix.readingRef + "GAL:5:1-1"
        ]
    ],
    [
        [
            "RSP_&D=0105&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورونثوس (11:16-33 &12:1-12)",
            "2COR:11:16-33 &12:1-12",
            "2COR:11:16-33 &12:1-12"
        ],
        [
            Prefix.readingRef + "2COR:11:16-End"
        ],
        [
            Prefix.readingRef + "2COR:12:1-12"
        ]
    ],
    [
        [
            "RSP_&D=0305&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورونثوس 13:11-13 & 14:1-4",
            "1COR: 13:11-13 & 14:1-4",
            "1COR: 13:11-13 & 14:1-4"
        ],
        [
            Prefix.readingRef + "1COR:13:11-13"
        ],
        [
            Prefix.readingRef + "1COR:14:1-4"
        ]
    ],
    [
        [
            "RSP_&D=JFast4||2609||0405||0511||0113&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَةِ (10: 4-18)",
            "ROM:(10: 4-18)",
            "ROM:(10: 4-18)"
        ],
        [
            Prefix.readingRef + "ROM:10:4-18"
        ]
    ],
    [
        [
            "RSP_&D=051stSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 15 : 4 - 19 )",
            "ROM:(15: 4-19)",
            "ROM:(15: 4-19)"
        ],
        [
            Prefix.readingRef + "ROM:15:4-19"
        ]
    ],
    [
        [
            "RSP_&D=052ndSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ غلاطية ( 5 : 2 - 10 )",
            "GAL: 5:2-10",
            "GAL:5:2-10"
        ],
        [
            Prefix.readingRef + "GAL:5:2-10"
        ]
    ],
    [
        [
            "RSP_&D=053rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين( 10 : 19 - 39 )",
            "HEB:10:19-39",
            "HEB:10:19-39"
        ],
        [
            Prefix.readingRef + "HEB:10:19-39"
        ]
    ],
    [
        [
            "RSP_&D=054thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 11 : 13 - 36 )",
            "ROM:(11: 13-36)",
            "ROM:(11: 13-36)"
        ],
        [
            Prefix.readingRef + "ROM:11:13-36"
        ]
    ],
    [
        [
            "RSP_&D=0605&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ فليبى ( 3 : 1 – 12 )",
            "PHP:3:1-12",
            "PHP:3:1-12"
        ],
        [
            Prefix.readingRef + "PHP:3:1-12"
        ]
    ],
    [
        [
            "RSP_&D=1005&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورونثوس (1:1-17)",
            "1CO:1:1-17",
            "1CO:1:1-17"
        ],
        [
            Prefix.readingRef + "1CO:1:1-17"
        ]
    ],
    [
        [
            "RSP_&D=1105&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ تيطس (2:11-15 & 3:1-7)",
            "TIT: 2:11-15 & 3:1-7",
            "TIT: 2:11-15 & 3:1-7"
        ],
        [
            Prefix.readingRef + "TIT:2:11-15"
        ],
        [
            Prefix.readingRef + "TIT:3:1-7"
        ]
    ],
    [
        [
            "RSP_&D=1205||Pntl27&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ (1 : 1 – 14 )",
            "EPH:(1: 1-14)",
            "EPH:(1: 1-14)"
        ],
        [
            Prefix.readingRef + "EPH:1:1-14"
        ]
    ],
    [
        [
            "RSP_&D=1305&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 6 : 3 – 16 )",
            "ROM:6:3-16",
            "ROM:6:3-16"
        ],
        [
            Prefix.readingRef + "ROM:6:3-16"
        ]
    ],
    [
        [
            "RSP_&D=2205&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ فليبى (3:20 - 4:1-9)",
            "PHP:3:20 - 4:1-9",
            "PHP:3:20-21&4:1-9"
        ],
        [
            Prefix.readingRef + "PHP:3:20-End"
        ],
        [
            Prefix.readingRef + "PHP:4:1-9"
        ]
    ],
    [
        [
            "RSP_&D=3005&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ ( 5 : 8 - 21 )",
            "EPH:5 : 8 - 21",
            "EPH:5:8-21"
        ],
        [
            Prefix.readingRef + "EPH:5:8-21"
        ]
    ],
    [
        [
            "RSP_&D=0206&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ العبرانيين ( 13 : 7 - 24 )",
            "HEB:13 : 7 - 24",
            "HEB:13:7-25"
        ],
        [
            Prefix.readingRef + "HEB:13:7-24"
        ]
    ],
    [
        [
            "RSP_&D=061stSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 5 : 11 - 6 : 1 - 11 )",
            "1CO: 5:11 - 6:1-11",
            "1CO:5:11-6:11"
        ],
        [
            Prefix.readingRef + "1CO:5:11-End"
        ],
        [
            Prefix.readingRef + "1CO:6:1-11"
        ]
    ],
    [
        [
            "RSP_&D=063rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ العبرانيين (3: 1 – 4: 2)",
            "HEB:3: 1 – 4: 2",
            "HEB:3: 1 – 4: 2"
        ],
        [
            Prefix.readingRef + "HEB:3:1-End"
        ],
        [
            Prefix.readingRef + "HEB:4:1-2"
        ]
    ],
    [
        [
            "RSP_&D=064thSunday&C=Title",
            " بولس الرسول إلى أَهْلِ كورونثوس الاولى ( 1 : 1 16 )",
            "1CO: 1 : 1-16",
            "1CO:1: 1 – 16"
        ],
        [
            Prefix.readingRef + "1CO:1:1-16"
        ]
    ],
    [
        [
            "RSP_&D=1307||2503&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورونثوس (10 :1 – 18 )",
            "2CO: (10: 1-18)",
            "2CO: (10: 1-18)"
        ],
        [
            Prefix.readingRef + "2CO:10:1-18"
        ]
    ],
    [
        [
            "RSP_&D=2308&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ رُومِيَّة ( 8 : 28 - 39 ) ",
            "ROM:8:28-39",
            "ROM:8:28-39"
        ],
        [
            Prefix.readingRef + "ROM:8:28-39"
        ]
    ],
    [
        [
            "RSP_&D=2708&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 8 : 18 - 30 )",
            "ROM:(8: 18-30)",
            "ROM:(8: 18-30)"
        ],
        [
            Prefix.readingRef + "ROM:8:18-30"
        ]
    ],
    [
        [
            "RSP_&D=3008&C=Title",
            " [[\"رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى تلميذه تيموثاوس (3:10-4:18)",
            "2TI: 3:10-4:18",
            "2 Timothy 3:10-4:18"
        ],
        [
            Prefix.readingRef + "2TI:3:10-End"
        ],
        [
            Prefix.readingRef + "2TI:4:1-18"
        ]
    ],
    [
        [
            "RSP_&D=0109&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ العبرانيين ( 9 : 1 - 12)",
            "HEB:9:1-12",
            "HEB:9:1-12"
        ],
        [
            Prefix.readingRef + "HEB:9:1-12"
        ]
    ],
    [
        [
            "RSP_&D=093rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ رُومِيَّة ( 15 : 13 - 29 )",
            "ROM:15:13-29",
            "ROM:15:13-29"
        ],
        [
            Prefix.readingRef + "ROM:15:13-29"
        ]
    ],
    [
        [
            "RSP_&D=094thSunday||102ndSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 2 : 6 - 16 )",
            "1CO:(2: 6-16)",
            "1CO:(2: 6-16)"
        ],
        [
            Prefix.readingRef + "1CO:2:6-16"
        ]
    ],
    [
        [
            "RSP_&D=2009&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس ( 3 : 4 - 23 )",
            "1CO: 3 : 4 - 23",
            "1CO:3:4-23"
        ],
        [
            Prefix.readingRef + "1CO:3:4-23"
        ]
    ],
    [
        [
            "RSP_&D=Pntl29&C=Title",
            "رِسَالَةِ بُولِسَ الرَسُولِ إلى أَهْلِ رُومِيَةِ (4: 4-9)",
            "ROM:(4: 4-9)",
            "ROM:(4: 4-9)"
        ],
        [
            Prefix.readingRef + "ROM:4:4-9"
        ]
    ],
    [
        [
            "RSP_&D=101stSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ رُومِيَّة ( 15 : 13 - 29 )",
            "ROM:(15: 13-29)",
            "ROM:(15: 13-29)"
        ],
        [
            Prefix.readingRef + "ROM:15:13-29"
        ]
    ],
    [
        [
            "RSP_&D=103rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورونثوس ( 4:1-16)",
            "1CO:4: 1 – 16",
            "1CO: 4 : 1 - 16"
        ],
        [
            Prefix.readingRef + "1CO:4:1–16"
        ]
    ],
    [
        [
            "RSP_&D=104thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ كُولُوسِي ( 4 : 2 - 18 )",
            "COL:4: 2 – 18",
            "COL:4: 2 – 18"
        ],
        [
            Prefix.readingRef + "COL:4:2–18"
        ]
    ],
    [
        [
            "RSP_&D=1610||1009||0201||3010&C=Title",
            " بولس الرسول إلى العبرانيين( 11 : 32 - 12 : 1 - 2 )",
            "HEB:(11:32 & 12:2)",
            "HEB:(11:32 & 12:2)"
        ],
        [
            Prefix.readingRef + "HEB:11:32-End"
        ],
        [
            Prefix.readingRef + "HEB:12:1-2"
        ]
    ],
    [
        [
            "RSP_&D=0311&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورونثوس ( 4 :5 – 5 :11)",
            "2CO: 4:5 - 5:1-11",
            "2CO: 4:5-18 & 5:1-11"
        ],
        [
            Prefix.readingRef + "2CO:4:5-End"
        ],
        [
            Prefix.readingRef + "2CO:5:1-11"
        ]
    ],
    [
        [
            "RSP_&D=111stSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس(9 : 1 - 27(",
            "1CO:9:1-27",
            "1CO:9:1-27"
        ],
        [
            Prefix.readingRef + "1CO:9:1-27"
        ]
    ],
    [
        [
            "RSP_&D=112ndSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ غلاطية( 1 : 1 - 24 )",
            "GAL: 1:1-24",
            "GAL: 1:1-24"
        ],
        [
            Prefix.readingRef + "GAL:1:1-24"
        ]
    ],
    [
        [
            "RSP_&D=113rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى تلميذه تيموثاوس ( 6: 3 - 16 )",
            "1TI:6:3-16",
            "1TI:6:3-16"
        ],
        [
            Prefix.readingRef + "1TI:6:3-16"
        ]
    ],
    [
        [
            "RSP_&D=114thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ فيلبي( 1 : 27 - 30 ، 2 : 1 - 11)",
            "PHP:1:27-2:11",
            "PHP:1:27-2:11"
        ],
        [
            Prefix.readingRef + "PHP:1:27-2:11"
        ]
    ],
    [
        [
            "RSP_&D=2011&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ تيموثاوس ( 2 : 3 – 15 )",
            "2TI: 2 : 3 - 15",
            "2 Timothy 2:3-15"
        ],
        [
            Prefix.readingRef + "2TI:2:3-15"
        ]
    ],
    [
        [
            "RSP_&D=0312&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس ( 3 : 1 - 8 )",
            "1CO: 3 : 1 - 8",
            "1CO:3:1-8"
        ],
        [
            Prefix.readingRef + "1CO:3:1-8"
        ]
    ],
    [
        [
            "RSP_&D=121stSunday&C=Title",
            "رسالة بولس الرَّسول الأولى إلى أَهْلِ كورنثوس (9: 1-27)",
            "1CO: (9: 1-27)",
            "1CO:(9: 1-27)"
        ],
        [
            Prefix.readingRef + "1CO:9:1-27"
        ]
    ],
    [
        [
            "RSP_&D=122ndSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ ( 6 : 1 – 23 )",
            "EPH:6:1-23",
            "EPH:6:1-23"
        ],
        [
            Prefix.readingRef + "EPH:6:1-23"
        ]
    ],
    [
        [
            "RSP_&D=123rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة (20- 17 : 16 )",
            "ROM:(16: 17-20)",
            "ROM:(16: 17-20)"
        ],
        [
            Prefix.readingRef + "ROM:16:17-20"
        ]
    ],
    [
        [
            "RSP_&D=124thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ تسالونيكى الأولى( 2 :13: 13 )",
            "1TH:2:13-3:13",
            "1Thessalonians 2:13-3:13"
        ],
        [
            Prefix.readingRef + "1TH:2:13-End"
        ],
        [
            Prefix.readingRef + "1TH:3:1-13"
        ]
    ],
    [
        [
            "RSP_&D=1312&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ كُولُوسِي (1:1-23)",
            "COL:1 : 1 - 23",
            "COL:1:1-23"
        ],
        [
            Prefix.readingRef + "COL:1:1-23"
        ]
    ],
    [
        [
            "RSP_&D=2703&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ أهل غلاطية ( 1 : 1 - 19 )",
            "GAL:(1: 1-19)",
            "GAL: (1: 1-19)"
        ],
        [
            Prefix.readingRef + "GAL:1:1-19"
        ]
    ],
    [
        [
            "RSP_&D=2512&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ فيلبي ( 3 : 20 ، 4 : 1 - 9 )",
            "PHP:3:20-4:1-9",
            "PHP:3:20-4:9"
        ],
        [
            Prefix.readingRef + "PHP:3:20-End"
        ],
        [
            Prefix.readingRef + "PHP:4:1-9"
        ]
    ],
    [
        [
            "RSP_&D=2812||0210&C=Title",
            " بولس الرسول الأولى إلى أَهْلِ عبرانين( 11 :1 - 10 )",
            "HEB:(11: 1-10)",
            "HEB:(11: 1-10)"
        ],
        [
            Prefix.readingRef + "HEB:11:1-10"
        ]
    ],
    [
        [
            "RSP_&D=2912&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الىأهل كورنثوس ( 10 : 25 - 11 : 1 )",
            "1CO:10:25 -11:1",
            "1CO:10:25-11:1"
        ],
        [
            Prefix.readingRef + "1CO:10:25-End"
        ],
        [
            Prefix.readingRef + "1CO:11:1-1"
        ]
    ],
    [
        [
            "RSP_&D=3012||Pntl41&C=Title",
            " البولس من رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ ( 4 : 8 - 16 )",
            "EPH:(4: 8-16)",
            "EPH:(4: 8-16)"
        ],
        [
            Prefix.readingRef + "EPH:4:8-16"
        ]
    ],
    [
        [
            "RSP_&D=0213&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس( 3 : 12 - 4 :1 - 4)",
            "2CO: 3:12 - 4:1-4",
            "2CO: 3:12-4:4"
        ],
        [
            Prefix.readingRef + "2CO:3:12-End"
        ],
        [
            Prefix.readingRef + "2CO:4:1-4"
        ]
    ],
    [
        [
            "RSP_&D=0413&C=Title",
            " بولس الرسول الأولى إلى أَهْلِ كورنثوس ( 3 : 9 - 23 )",
            "1CO: 3:9-23",
            "1CO:3:9-23"
        ],
        [
            Prefix.readingRef + "1CO:3:9-23"
        ]
    ],
    [
        [
            "RSP_&D=0613&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ كُولُوسِي ( 3 : 8 – 17 )",
            "COL:3 : 8-17",
            "COL:3:8-17"
        ],
        [
            Prefix.readingRef + "COL:3:8-17"
        ]
    ],
    [
        [
            "RSP_&D=GL10&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 1 : 18 - 25 )",
            "ROM:(1: 18-25)",
            "ROM:(1: 18-25)"
        ],
        [
            Prefix.readingRef + "ROM:1:18-25"
        ]
    ],
    [
        [
            "RSP_&D=GL11&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس ( 9 : 6 - 15 )",
            "2CO: 9:6-15",
            "2CO: 9:6-15"
        ],
        [
            Prefix.readingRef + "2CO:9:6-15"
        ]
    ],
    [
        [
            "RSP_&D=GL12&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 3 : 1 - 17 )",
            "ROM:(3: 1-17)",
            "ROM:(3: 1-17)"
        ],
        [
            Prefix.readingRef + "ROM:3:1-17"
        ]
    ],
    [
        [
            "RSP_&D=GL13&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة 16:17-27",
            "ROM:(16: 17-27)",
            "ROM:(16: 17-27)"
        ],
        [
            Prefix.readingRef + "ROM:16:17-27"
        ]
    ],
    [
        [
            "RSP_&D=GL14&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين( 12 : 28 - 13 : 1 - 16 )",
            "HEB:12:28-13:16",
            "HEB:12:28-13:16"
        ],
        [
            Prefix.readingRef + "HEB:12:28-End"
        ],
        [
            Prefix.readingRef + "HEB:13:1-16"
        ]
    ],
    [
        [
            "RSP_&D=GL15&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 14 : 1 - 18 )",
            "ROM:(14: 1-18)",
            "ROM:(14: 1-18)"
        ],
        [
            Prefix.readingRef + "ROM:14:1-18"
        ]
    ],
    [
        [
            "RSP_&D=GL17&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس(5 : 9 - 6 :1 - 5 )",
            "1CO: 5:9 - 6:1-5",
            "1CO:5:9-6:5"
        ],
        [
            Prefix.readingRef + "1CO:5:9-End"
        ],
        [
            Prefix.readingRef + "1CO:6:1-5"
        ]
    ],
    [
        [
            "RSP_&D=GL18&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 4 : 1 - 8 )",
            "ROM:(4: 1-8)",
            "ROM:(4: 1-8)"
        ],
        [
            Prefix.readingRef + "ROM:4:1-8"
        ]
    ],
    [
        [
            "RSP_&D=GL19&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ تسالونيكي الثانية ( 2 : 9 - 17 )",
            "2TH: 2:9-17",
            "2 Thessalonians 2:9-17"
        ],
        [
            Prefix.readingRef + "2TH:2:9-17"
        ]
    ],
    [
        [
            "RSP_&D=GL1&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس( 6 : 14 - 7 : 1 - 16 )",
            "2CO: 6:14-7:16",
            "2CO: 6:14-7:16"
        ],
        [
            Prefix.readingRef + "2CO:6:14-End"
        ],
        [
            Prefix.readingRef + "2CO:7:1-16"
        ]
    ],
    [
        [
            "RSP_&D=GL1stSunday||GL2&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس( 11 : 16 - 28 )",
            "2CO: 11 : 16 - 28",
            "2CO: 11:16-28"
        ],
        [
            Prefix.readingRef + "2CO:11:16-28"
        ]
    ],
    [
        [
            "RSP_&D=GL20&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة 4 :6- 11",
            "ROM:(4: 6-11)",
            "ROM:(4: 6-11)"
        ],
        [
            Prefix.readingRef + "ROM:4:6-11"
        ]
    ],
    [
        [
            "RSP_&D=GL21&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين (11:1-8)",
            "HEB:11:1-8",
            "HEB:11:1-8"
        ],
        [
            Prefix.readingRef + "HEB:11:1-8"
        ]
    ],
    [
        [
            "RSP_&D=GL22&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس ( 7 : 2 - 11 )",
            "2CO: 7 : 2 – 11",
            "2CO: 7:2-11"
        ],
        [
            Prefix.readingRef + "2CO:7:2–11"
        ]
    ],
    [
        [
            "RSP_&D=GL24&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 8 : 12 - 26 )",
            "ROM:8:12-26",
            "ROM:8:12-26"
        ],
        [
            Prefix.readingRef + "ROM:8:12-26"
        ]
    ],
    [
        [
            "RSP_&D=GL25&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ ( 4 : 1 - 16 )",
            "EPH:4 : 1 - 16",
            "EPH:4:1-16"
        ],
        [
            Prefix.readingRef + "EPH:4:1-16"
        ]
    ],
    [
        [
            "RSP_&D=GL26&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ ( 4 : 17 - 32 )",
            "EPH:4:17-32",
            "EPH:4:17-32"
        ],
        [
            Prefix.readingRef + "EPH:4:17-32"
        ]
    ],
    [
        [
            "RSP_&D=GL27&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 12 : 31 - 13 : 1 - 14 : 1 )",
            "1CO:12:31-14:1",
            "1CO:12:31-14:1"
        ],
        [
            Prefix.readingRef + "1CO:12:31-End"
        ],
        [
            Prefix.readingRef + "1CO:13:1-14"
        ]
    ],
    [
        [
            "RSP_&D=GL28&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين(13 : 7 – 16 )",
            "HEB:13:7 - 16",
            "HEB:13:7-16"
        ],
        [
            Prefix.readingRef + "HEB:13:7-16"
        ]
    ],
    [
        [
            "RSP_&D=GL29&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ فيلبي( 4 : 4 - 9 )",
            "PHP:4 : 4 - 9",
            "PHP:4:4-9"
        ],
        [
            Prefix.readingRef + "PHP:4:4-9"
        ]
    ],
    [
        [
            "RSP_&D=GL2ndSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 13 : 1 - 14 )",
            "ROM:(13: 1–14)",
            "ROM:(13: 1-14)"
        ],
        [
            Prefix.readingRef + "ROM:13:1–14"
        ]
    ],
    [
        [
            "RSP_&D=GL31&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ فيلبي ( 2 : 1 - 16 )",
            "PHP:2:1-16",
            "PHP:2:1-16"
        ],
        [
            Prefix.readingRef + "PHP:2:1-16"
        ]
    ],
    [
        [
            "RSP_&D=GL32&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ فيلبي( 2 : 22 - 26 )",
            "PHP:2:22-26",
            "PHP:2:22-26"
        ],
        [
            Prefix.readingRef + "PHP:2:22-26"
        ]
    ],
    [
        [
            "RSP_&D=GL33&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 4 : 14 - 5 : 1 - 5 )",
            "ROM:(4:14 - 5:1-5)",
            "ROM:(4:14-5:5)"
        ],
        [
            Prefix.readingRef + "ROM:4:14-End"
        ],
        [
            Prefix.readingRef + "ROM:5:1-5"
        ]
    ],
    [
        [
            "RSP_&D=GL34&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 10 : 14 - 11 : 1 )",
            "1CO: 10:14 - 11:1",
            "1CO:10:14-11:1"
        ],
        [
            Prefix.readingRef + "1CO:10:14-End"
        ],
        [
            Prefix.readingRef + "1CO:11:1-1"
        ]
    ],
    [
        [
            "RSP_&D=GL35&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين( 12 : 5 - 16 )",
            "HEB:12:5-16",
            "HEB:12:5-16"
        ],
        [
            Prefix.readingRef + "HEB:12:5-16"
        ]
    ],
    [
        [
            "RSP_&D=GL36||GL43&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ غلاطية( 5 : 16 - 6 : 1 - 2 )",
            "GAL:(5: 16-6:2)",
            "GAL: (5: 16-6:2)"
        ],
        [
            Prefix.readingRef + "GAL:5:16-End"
        ],
        [
            Prefix.readingRef + "GAL:6:1-2"
        ]
    ],
    [
        [
            "RSP_&D=GL38&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ تسالونيكي( 4 : 1 - 18 )",
            "1 Thessalonians 4:1-18",
            "1 Thessalonians 4:1-18"
        ],
        [
            Prefix.readingRef + "1TH4:1-18"
        ]
    ],
    [
        [
            "RSP_&D=GL39&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 14 : 18 - 28 )",
            "1CO:14:18-28",
            "1CO:14:18-28"
        ],
        [
            Prefix.readingRef + "1CO:14:18-28"
        ]
    ],
    [
        [
            "RSP_&D=GL3&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية(1:26-2:7)",
            "ROM:(1:26-2:7)",
            "ROM:(1:26-2:7)"
        ],
        [
            Prefix.readingRef + "ROM:1:26-End"
        ],
        [
            Prefix.readingRef + "ROM:2:1-7"
        ]
    ],
    [
        [
            "RSP_&D=GL40&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة (2:12-24)",
            "ROM:(2: 12-24)",
            "ROM:(2: 12-24)"
        ],
        [
            Prefix.readingRef + "ROM:2:12-24"
        ]
    ],
    [
        [
            "RSP_&D=GL41&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى تلميذه تيموثاوس( 2 : 1 - 3 : 1 - 4 )",
            "1TI:2:1-3:4",
            "1TI:2:1-3:4"
        ],
        [
            Prefix.readingRef + "1TI:2:1-End"
        ],
        [
            Prefix.readingRef + "1TI:3:1-4"
        ]
    ],
    [
        [
            "RSP_&D=GL42&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 10 : 1 - 13 )",
            "1CO:10:1-13",
            "1CO:10:1-13"
        ],
        [
            Prefix.readingRef + "1CO:10:1-13"
        ]
    ],
    [
        [
            "RSP_&D=GL45&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 14 : 10 - 15 : 1 ، 2 )",
            "ROM:(14:10 - 15:1,2)",
            "ROM:(14:10-15:2)"
        ],
        [
            Prefix.readingRef + "ROM:14:10-End"
        ],
        [
            Prefix.readingRef + "ROM:15:1-2"
        ]
    ],
    [
        [
            "RSP_&D=GL46&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس(14:5-17)",
            "1CO:14:5-17",
            "1CO:14:5-17"
        ],
        [
            Prefix.readingRef + "1CO:14:5-17"
        ]
    ],
    [
        [
            "RSP_&D=GL47&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَةِ (10: 4-13)",
            "ROM:(10: 4-13)",
            "ROM:(10: 4-13)"
        ],
        [
            Prefix.readingRef + "ROM:10:4-13"
        ]
    ],
    [
        [
            "RSP_&D=GL48&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ كورنثوس( 4 : 5 - 18 )",
            "2CO: 4:5-18",
            "2CO: 4:5-18"
        ],
        [
            Prefix.readingRef + "2CO:4:5-18"
        ]
    ],
    [
        [
            "RSP_&D=GL49&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى تلميذه تيموثاوس( 3 : - 4 :1 - 5 )",
            "2TI: 3:1 - 4:1-5",
            "2 Timothy 3:1-4:5"
        ],
        [
            Prefix.readingRef + "2TI:4:1-5"
        ]
    ],
    [
        [
            "RSP_&D=GL4&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 9 : 14 - 29 )",
            "ROM:(9: 15–29)",
            "ROM:(9: 15–29)"
        ],
        [
            Prefix.readingRef + "ROM:9:15–29"
        ]
    ],
    [
        [
            "RSP_&D=GL4thSunday&C=Title",
            " بولس الرسول إلى أَهْلِ كورنثوس الثانية ( 6 : 2 - 13 )",
            "2CO: 6 : 2- 13",
            "2CO: 6:2-13"
        ],
        [
            Prefix.readingRef + "2CO:6:2-13"
        ]
    ],
    [
        [
            "RSP_&D=GL50&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورنثوس( 2 : 1 - 8 )",
            "1CO: 2 : 1-8",
            "1CO:2:1-8"
        ],
        [
            Prefix.readingRef + "1CO:2:1-8"
        ]
    ],
    [
        [
            "RSP_&D=GL55&C=Title",
            "كورنثوس الأولى ( 11: 23 الخ)",
            "1CO: (11: 23-34)",
            ""
        ],
        [
            Prefix.readingRef + "1CO:11:23-34"
        ]
    ],
    [
        [
            "HW_&D=GL55&C=Title",
            "",
            "1ère épître de saint Paul à Timothée \n4 : 9 à 5 : 10",
            ""
        ],
        [
            Prefix.readingRef + "1TI:4:9-End"
        ],
        [
            Prefix.readingRef + "1TI:5:1-10"
        ]
    ],
    [
        [
            "RSP_&D=GL5||GL3rdSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية(14:19-15:7)",
            "ROM:(14: 19 & 15:7)",
            "ROM:(14: 19 & 15:7)"
        ],
        [
            Prefix.readingRef + "ROM:14:19-End"
        ],
        [
            Prefix.readingRef + "ROM:15:1-7"
        ]
    ],
    [
        [
            "RSP_&D=GL5thSunday&C=Title",
            " بولس الرسول إلى أَهْلِ أفسس( 6 : 10 - 24 )",
            "EPH:6 : 10 -24",
            "EPH:6:10-24"
        ],
        [
            Prefix.readingRef + "EPH:6:10-24"
        ]
    ],
    [
        [
            "RSP_&D=GL6&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورونثوس ( 4 : 16 -5 : 9)",
            "1CO:4:16-5:9",
            "1CO:4:16-5:9"
        ],
        [
            Prefix.readingRef + "1CO:4:16-End"
        ],
        [
            Prefix.readingRef + "1CO:5:1-9"
        ]
    ],
    [
        [
            "RSP_&D=GL6thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ تسالونيكي( 2 : 1 - 17 )",
            "2TH:2:1-17",
            "2Thessalonians2:1-17"
        ],
        [
            Prefix.readingRef + "2TH:2:1-17"
        ]
    ],
    [
        [
            "RSP_&D=GL7&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 12 : 6 – 21 )",
            "ROM:(12: 6-21)",
            "ROM:(12: 6-21)"
        ],
        [
            Prefix.readingRef + "ROM:12:6-21"
        ]
    ],
    [
        [
            "RSP_&D=GL7thSunday&C=Title",
            " بولس الرسول إلى أَهْلِ كُولُوسِي ( 3 : 5 - 17 )",
            "COL:3 : 5-17",
            "COL:3:5-17"
        ],
        [
            Prefix.readingRef + "COL:3:5-17"
        ]
    ],
    [
        [
            "RSP_&D=GL8&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ((12: 1-21))",
            "ROM:(12: 1-21)",
            "ROM:(12: 1-21)"
        ],
        [
            Prefix.readingRef + "ROM:12:1-21"
        ]
    ],
    [
        [
            "RSP_&D=GL8thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين( 9 : 11 - 28 )",
            "HEB:9: 11-28",
            "HEB:9:11-28"
        ],
        [
            Prefix.readingRef + "HEB:9:11-28"
        ]
    ],
    [
        [
            "RSP_&D=Pntl10&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 1 : 11 – 13 )",
            "ROM:1:11-13",
            "ROM:1:11-13"
        ],
        [
            Prefix.readingRef + "ROM:1:11-13"
        ]
    ],
    [
        [
            "RSP_&D=Pntl11&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 1 : 16 – 17 )",
            "ROM:1:16-17",
            "ROM:1:16-17"
        ],
        [
            Prefix.readingRef + "ROM:1:16-17"
        ]
    ],
    [
        [
            "RSP_&D=Pntl12&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى رُومِيَّة ( 1 : 19 – 21 )",
            "ROM:1:19-21",
            "ROM:1:19-21"
        ],
        [
            Prefix.readingRef + "ROM:1:19-21"
        ]
    ],
    [
        [
            "RSP_&D=Pntl13&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الثَانِيَةِ إلى أَهْلِ تيطس الثانية ( 2 : 8 – 15 )",
            "2 Timothy 2:8-15",
            "2 Timothy 2:8-15"
        ],
        [
            Prefix.readingRef + "2TI2:8-15"
        ]
    ],
    [
        [
            "RSP_&D=Pntl15&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 2 : 4 - 7 )",
            "ROM:2:4-7",
            "ROM:2:4-7"
        ],
        [
            Prefix.readingRef + "ROM:2:4-7"
        ]
    ],
    [
        [
            "RSP_&D=Pntl16&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الى أهل رُومِيَّة (2:8-13)",
            "ROM:(2: 8-13)",
            "ROM:(2: 8-13)"
        ],
        [
            Prefix.readingRef + "ROM:2:8-13"
        ]
    ],
    [
        [
            "RSP_&D=Pntl17&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومية( 2 : 14 - 16 )",
            "ROM:2:14-16",
            "ROM:2:14-16"
        ],
        [
            Prefix.readingRef + "ROM:2:14-16"
        ]
    ],
    [
        [
            "RSP_&D=Pntl18&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 2 : 17 - 20 )",
            "ROM:2:17-20",
            "ROM:2:17-20"
        ],
        [
            Prefix.readingRef + "ROM:2:17-20"
        ]
    ],
    [
        [
            "RSP_&D=Pntl19&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 2 : 25 – 29 )",
            "ROM:2:25-29",
            "ROM:2:25-29"
        ],
        [
            Prefix.readingRef + "ROM:2:25-29"
        ]
    ],
    [
        [
            "RSP_&D=Pntl1&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ تسالونيكى( 4: 13-5:11 )",
            "1TH:4:13-5:1-11",
            "1 Thessalonians 4:13-5:11"
        ],
        [
            Prefix.readingRef + "1TH:4:13-End"
        ],
        [
            Prefix.readingRef + "1TH:5:1-11"
        ]
    ],
    [
        [
            "RSP_&D=Pntl1stSunday&C=Title",
            "رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ (4: 20-32)",
            "Éphisiens (4: 20-32)",
            "Ephisians (4: 20-32)"
        ],
        [
            Prefix.readingRef + "EPH:4:20-32"
        ]
    ],
    [
        [
            "RSP_&D=Pntl20&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ غلاطية ( 3 : 5 - 11 )",
            "Galantins 3:5-11",
            "GAL: 3:5-11"
        ],
        [
            Prefix.readingRef + "GAL:3:5-11"
        ]
    ],
    [
        [
            "RSP_&D=Pntl22&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 4 : 4 - 8 )",
            "ROM:4:4-8",
            "ROM:4:4-8"
        ],
        [
            Prefix.readingRef + "ROM:4:4-8"
        ]
    ],
    [
        [
            "RSP_&D=Pntl23&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الى أهل رُومِيَّة (3:19-21)",
            "ROM:(3: 19-21)",
            "ROM:(3: 19-21)"
        ],
        [
            Prefix.readingRef + "ROM:3:19-21"
        ]
    ],
    [
        [
            "RSP_&D=Pntl24&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ افسس ( 2 : 13 - 18 )",
            "EPH:2:13-18",
            "EPH:2:13-18"
        ],
        [
            Prefix.readingRef + "EPH:2:13-18"
        ]
    ],
    [
        [
            "RSP_&D=Pntl25&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة (3:21-26)",
            "ROM:3:21-26",
            "ROM:3:21-26"
        ],
        [
            Prefix.readingRef + "ROM:3:21-26"
        ]
    ],
    [
        [
            "RSP_&D=Pntl26&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى رُومِيَّة ( 3 : 27 – 31 )",
            "ROM:3:27-31",
            "ROM:3:27-31"
        ],
        [
            Prefix.readingRef + "ROM:3:27-31"
        ]
    ],
    [
        [
            "RSP_&D=Pntl2ndSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ (2:19-3:10 )",
            "EPH:2:19-22/3:1-9",
            "EPH:2:19-3:10"
        ],
        [
            Prefix.readingRef + "EPH:2:19-22"
        ],
        [
            Prefix.readingRef + "EPH:3:1-9"
        ]
    ],
    [
        [
            "RSP_&D=Pntl2&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الى أهل رُومِيَّة ( 5 : 6 : 21 )",
            "ROM:(5: 6-21)",
            "ROM:(5: 6-21)"
        ],
        [
            Prefix.readingRef + "ROM:5:6-21"
        ]
    ],
    [
        [
            "RSP_&D=Pntl30&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الى أهل رُومِيَّة (4:9-12)",
            "ROM:(4: 9-12)",
            "ROM:(4: 9-12)"
        ],
        [
            Prefix.readingRef + "ROM:4:9-12"
        ]
    ],
    [
        [
            "RSP_&D=Pntl31&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 5 : 20 – 6 : 4 )",
            "ROM:5:20-6:4",
            "ROM:5:20-6:4"
        ],
        [
            Prefix.readingRef + "ROM:5:20-End"
        ],
        [
            Prefix.readingRef + "ROM:6:1-4"
        ]
    ],
    [
        [
            "RSP_&D=Pntl32&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 6 : 5 : 11 )",
            "ROM:6:5-11",
            "ROM:6:5-11"
        ],
        [
            Prefix.readingRef + "ROM:6:5-11"
        ]
    ],
    [
        [
            "RSP_&D=Pntl33&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 6 : 17 – 22 )",
            "ROM:6:17-22",
            "ROM:6:17-22"
        ],
        [
            Prefix.readingRef + "ROM:6:17-22"
        ]
    ],
    [
        [
            "RSP_&D=Pntl34&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ العبرانيين ( 10 1 : 13 )",
            "HEB:10:1-13",
            "HEB:10:1-13"
        ],
        [
            Prefix.readingRef + "HEB:10:1-13"
        ]
    ],
    [
        [
            "RSP_&D=Pntl36&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رومبة ( 8 : 2 – 5 )",
            "ROM:(8: 2-5)",
            "ROM:(8: 2-5)"
        ],
        [
            Prefix.readingRef + "ROM:8:2-5"
        ]
    ],
    [
        [
            "RSP_&D=Pntl37&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الى أهل رُومِيَّة (8:9-11)",
            "ROM:(8: 9-11)",
            "ROM:(8: 9-11)"
        ],
        [
            Prefix.readingRef + "ROM:8:9-11"
        ]
    ],
    [
        [
            "RSP_&D=Pntl38&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ رُومِيَّة (7:1-8)",
            "ROM:(7: 1-8)",
            "ROM:(7: 1-8)"
        ],
        [
            Prefix.readingRef + "ROM:7:1-8"
        ]
    ],
    [
        [
            "RSP_&D=Pntl39&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ تيموثاوس الأولى ( 3 : 13 – 16 )",
            "1TI:3:13 - 16",
            "1TI:3:13-16"
        ],
        [
            Prefix.readingRef + "1TI:3:13-16"
        ]
    ],
    [
        [
            "RSP_&D=Pntl3rdSunday&C=Title",
            " بولس الرسول إلى أَهْلِ كُولُوسِي ( 3 : 1 : 17 )",
            "COL:3:1 - 17",
            "COL:3:1-17"
        ],
        [
            Prefix.readingRef + "COL:3:1-17"
        ]
    ],
    [
        [
            "RSP_&D=Pntl3&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورونثوس (15 : 50 – 58 )",
            "1CO:15:50-58",
            "1CO:15:50-58"
        ],
        [
            Prefix.readingRef + "1CO:15:50-58"
        ]
    ],
    [
        [
            "RSP_&D=Pntl40&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورونثوس (11:2-16)",
            "1CO:11:2-16",
            "1CO:11:2-16"
        ],
        [
            Prefix.readingRef + "1CO:11:2-16"
        ]
    ],
    [
        [
            "RSP_&D=Pntl43&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الى أهل رُومِيَّة ( 8 : 12 - 17 )",
            "ROM:8:12-17",
            "ROM:8:12-17"
        ],
        [
            Prefix.readingRef + "ROM:8:12-17"
        ]
    ],
    [
        [
            "RSP_&D=Pntl44&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الى أهل رُومِيَّة (8:22 - 27 )",
            "ROM:(8: 22-27)",
            "ROM:(8: 22-27)"
        ],
        [
            Prefix.readingRef + "ROM:8:22-27"
        ]
    ],
    [
        [
            "RSP_&D=Pntl45&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 8 : 28 – 39 )",
            "ROM:(8: 28-39)",
            "ROM:(8: 28-39)"
        ],
        [
            Prefix.readingRef + "ROM:8:28-39"
        ]
    ],
    [
        [
            "RSP_&D=Pntl46&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ كورونثوس الأولى ( 14 : 5-11)",
            "1CO: 14:5-11",
            "1CO:14:5-11"
        ],
        [
            Prefix.readingRef + "1CO:14:5-11"
        ]
    ],
    [
        [
            "RSP_&D=Pntl47&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى إلى أَهْلِ كورونثوس ( 14 : 12 – 17 )",
            "1CO:14:12-17",
            "1CO:14:12-17"
        ],
        [
            Prefix.readingRef + "1CO:14:12-17"
        ]
    ],
    [
        [
            "RSP_&D=Pntl48&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الأولى الى اهل كورونثوس ( 12 : 31 - 14 : 4 )",
            "1CO: 13:1-13,14:4",
            "1CO:12:31-14:4"
        ],
        [
            Prefix.readingRef + "1CO:13:1-13"
        ],
        [
            Prefix.readingRef + "1CO:14:1-4"
        ]
    ],
    [
        [
            "RSP_&D=Pntl4&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ أَفَسُسْ (1 : 15 – 2 :1 – 3 )",
            "EPH:1:15 - /-3",
            "EPH:1:15-2:3"
        ],
        [
            Prefix.readingRef + "EPH:1:15-End"
        ],
        [
            Prefix.readingRef + "EPH:2:1-3"
        ]
    ],
    [
        [
            "RSP_&D=Pntl4thSunday&C=Title",
            " بولس الرسول إلى أَهْلِ تسالونيكى الثانية ( 2 : 13 – 3 : 5 )",
            "2TH:2:13- 3:5",
            "2Thessalonians 2:13-3:5"
        ],
        [
            Prefix.readingRef + "2TH:2:13-End"
        ],
        [
            Prefix.readingRef + "2TH:3:1-5"
        ]
    ],
    [
        [
            "RSP_&D=Pntl5&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى العبرانيين(13:10 - 21)",
            "HEB:13:10 - 21",
            "HEB:13:10-21"
        ],
        [
            Prefix.readingRef + "HEB:13:10-21"
        ]
    ],
    [
        [
            "RSP_&D=Pntl5thSunday&C=Title",
            " بولس الرسول إلى أَهْلِ العبرانيين( 10 :19 - 38)",
            "HEB:10:19 - 38",
            "HEB:10:19-38"
        ],
        [
            Prefix.readingRef + "HEB:10:19-38"
        ]
    ],
    [
        [
            "RSP_&D=Pntl6&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ كُولُوسِي ( 1 : 12 – 23 )",
            "COL:1:12-23",
            "COL:1:12-23"
        ],
        [
            Prefix.readingRef + "COL:1:12-23"
        ]
    ],
    [
        [
            "RSP_&D=Pntl6thSunday&C=Title",
            " بولس الرسول إلى أَهْلِ كورونثوس الأولى ( 15 : 57 – 16 : 8 )",
            "1Corinthiens15:57-16:8",
            "1CO:15:57-16:8"
        ],
        [
            Prefix.readingRef + "1CO:15:57-End"
        ],
        [
            Prefix.readingRef + "1CO:16:1-8"
        ]
    ],
    [
        [
            "RSP_&D=Pntl7thSunday||Pntl8thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى الأولى أهل كورونثوس ( 12 : 1 - 21)",
            "1CO: (12: 1-21)",
            "1CO:(12: 1-21)"
        ],
        [
            Prefix.readingRef + "1CO:12:1-21"
        ]
    ],
    [
        [
            "RSP_&D=Pntl8&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ إلى أَهْلِ رُومِيَّة ( 1 : 1 – 4 )",
            "ROM:1:1-4",
            "ROM:1:1-4"
        ],
        [
            Prefix.readingRef + "ROM:1:1-4"
        ]
    ],
    [
        [
            "RSP_&D=Pntl9&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الى أهل رُومِيَّة (1:7-10)",
            "ROM:(1: 7-10)",
            "ROM:(1: 7-10)"
        ],
        [
            Prefix.readingRef + "ROM:1:7-10"
        ]
    ],
    [
        [
            "RSP_&D=GL9thSunday&C=Title",
            " رِسَالَةِ بُولِسِ الرَسُولِ الاولى إلى أَهْلِ كورنثوس(15:23-50)",
            "1CO: 15:23-50",
            "1CO:15:23-50"
        ],
        [
            Prefix.readingRef + "1CO:15:23-50"
        ]
    ],
    [
        [
            "RSP_&D=022ndSunday&C=Title",
            "رسالة بولس الرَّسول الثانية إلى أَهْلِ كورنثوس (4: 5-15)",
            "2CO: (4: 5-15)",
            "2CO: (4: 5-15)"
        ],
        [
            Prefix.readingRef + "2CO:4:5-15"
        ]
    ],
    [
        [
            "RSP_&D=024thSunday&C=Title",
            "رسالة بولس الرَّسول الأولى إلى تيموثاوس (6: 3-21)",
            "1TI:(6: 3-21)",
            "1TI:(6: 3-21)"
        ],
        [
            Prefix.readingRef + "1TI:6:3-21"
        ]
    ]
];;